Repository: xinux-org/e-imzo-manager
Catalog: po/*.po
Languages: ru, uz

source: E-IMZO-Manager
ru: О менеджере E-IMZO
uz: E-IMZO Menejer

source: Nix effort for E-IMZO service.
ru: Усилия в Linux для сервиса E-IMZO.
uz: E-IMZO xizmati uchun Nix harakati.

source: Window width
ru: Ширина окна
uz: Ilova kengligi

source: Window height
ru: Высота окна
uz: Ilova balandligi

source: Window maximized state
ru: Состояние окна развернуто
uz: Ilovaning maksimal holati

source: E-IMZO Manager
ru: О менеджере E-IMZO

source: Improving E-IMZO support and compatibility for Linux
ru: Улучшение поддержки и совместимости E-IMZO для Linux
uz: Linux uchun E-IMZOni qo'llab-quvvatlash va muvofiqligini yaxshilash

source: An electronic digital signature certificate is very important for verifying the time a document was signed and its legal status.
ru: Сертификат электронной цифровой подписи очень важен для проверки времени подписания документа и его юридического статуса.
uz: Elektron raqamli imzo sertifikati hujjat imzolangan vaqt va uning huquqiy holatini tekshirish uchun juda muhimdir.

source: Main window
ru: Главное окно
uz: Asosiy oyna

source: Xinux Developers
ru: Разработчики Xinux
uz: Xinux dasturchilari

# shortcut window
source: General
ru: Общий
uz: Umumiy

# shortcut window
source: Show Shortcuts
ru: Показать ярлыки
uz: Yorliqlarni ko‘rsatish

# shortcut window
source: Quit
ru: Выйти
uz: Chiqish

source: Ok
ru: Хорошо

source: Are you sure?
ru: Вы уверены?
uz: Ishonchingiz komilmi?

source: Do you really want to delete this certificate?
ru: Вы действительно хотите удалить этот сертификат?
uz: Haqiqatan ham bu sertifikatni olib tashlamoqchimisiz?

source: Yes
ru: Да
uz: Ha

source: No
ru: Нет
uz: Yoʻq

source: © 2025 Xinux Developers
ru: © 2025 Разработчики Xinux
uz: © 2025 Xinux dasturchilari

source: <p>This release contains new features and fixes:</p> <ul> <li>Updated english, uzbek, russian translation</li> <li>Added hover text on add, toggle buttons</li> <li>Add factory deque. Remove certificates without refreshing page</li> <li>Added button click limiter</li> <li>Added Scrolled Window to file selection page</li> <li>Deleted remove certificate button icon and replaced to the red trash bin icon</li> <li>Made mobile responsive</li> </ul>
ru: <p>Эта версия содержит новые функции и исправления:</p> <ul> <li>Обновлённый английский, узбекский и русский перевод</li> <li>Добавить, переключить кнопки</li> <li>Добавить заводскую деку. Удалить сертификаты без обновления страницы</li> <li>Добавлен ограничитель щелчков по кнопке</li> <li>Добавлено прокрученное окно для страницы выбора файлов</li> <li>Икона кнопки удаления сертификата удалена и заменена на красную значок корзины для мусора</li> <li>Фиксированный размер мобильного телефона</li> </ul>
uz: <p>Bu nashrda yangi funksiyalar va tuzatishlar mavjud:</p> <ul> <li>Yangilangan inglizcha, oʻzbekcha, ruscha tarjimasi</li> <li>Qoʻshish, almashtirish tugmalarini</li> ushlab turish matni kiritildi <li>Sertifikatlarni sahifani yangilanishsiz olib tashlash</li> <li>Fayllarni tanlash sahifasiga aylantirilgan oyna qo‘shildi</li> <li>Sertifikatni olib tashlash tugmasi belgisi oʻchirildi va qizil chiqindi qutisi belgisiga almashtirildi</li> <li>Dastur dizayni mobil ekranlari uchun toʻgʻrilandi</li> </ul>

source: Awesome E-IMZO
ru: Список E-IMZO
uz: E-IMZO ro‘yxati

source: Open https://127.0.0.1:64443/
ru: Открыть https://127.0.0.1:64443/
uz: Ochish https://127.0.0.1:64443/

source: Keyboard
ru: Клавиатура
uz: Yorliqlar

source: About E-IMZO Manager
ru: О менеджере E-IMZO
uz: E-IMZO Manager haqida

source: Add key
ru: Добавить ключ
uz: Kalit qoʻshish

source: Service is ON - Click to stop
ru: Сервис ВКЛЮЧЕН - Нажмите, чтобы остановить
uz: Xizmat YONIQ - Toʻxtatish uchun bosing

source: Service is OFF - Click to start
ru: Сервис ОТКЛЮЧЕН - Нажмите, чтобы начать
uz: Xizmat OʻCHIRILGAN - Boshlash uchun bosing

source: Quit
ru: Выйти
uz: Chiqish

source: Start/Stop Service
ru: Запуск/Остановка сервиса
uz: Xizmatni boshlash/to‘xtatish

source: E-IMZO service stopped
ru: Сервис E-IMZO остановлен
uz: E-IMZO servisi o‘chirildi

source: E-IMZO service started
ru: Сервис E-IMZO запущен
uz: E-IMZO servisi yondi

source: Welcome to E-imzo
ru: Добро пожаловать в E-imzo
uz: E-IMZOga xush kelibsiz

source: Please click the red button to start e-imzo service
ru: Нажмите красную кнопку, чтобы запустить услугу e-imzo
uz: Iltimos e-imzo servisini yoqish uchun qizil tugmani bosing

source: Please download e-imzo service and relaunch the app again.
ru: Пожалуйста, скачайте услугу e-imzo и перезапустите приложение.
uz: Iltimos, ilovani yuklab oling va qayta ishga tushiring.

source: List of used e-imzo websites
ru: Список использованных сайтов e-imzo
uz: e-imzo ishlatilgan saytlar roʻyxati

source: No certificates
ru: Сертификатов нет
uz: Sertifikatlar yoʻq

source: Load some certificates to start using the app.
ru: Загрузите несколько сертификатов, чтобы начать использовать приложение.
uz: Ilovadan foydalanishni boshlash uchun ayrim sertifikatlarni yuklab oling.

source: Load .pfx
ru: Загрузить .pfx
uz: .pfx fayl yuklash

source: Loaded keys
ru: Загруженные ключи
uz: Mavjud kalitlar

source: Loading keys
ru: Ключи загружаются
uz: Kalitlar yuklanmoqda

source: Cancel
ru: Отменить
uz: Bekor qilish

source: Open
ru: Открытый
uz: Ochish

source: File already exists. You can use it
ru: Файл уже существует. Вы можете его использовать
uz: Fayl allaqachon mavjud. Siz e-imzo kalitini foydalanishingiz mumkin

source: Full name
ru: Полное имя
uz: F.I.O

source: Certificate number
ru: Номер сертификата
uz: Sertifikat raqami

source: Certificate validity period
ru: Срок действия сертификата
uz: Sertifikatning amal qilish muddati

source: Expired
ru: Срок истек

source: Active
ru: Активный
